units = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
teens = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
tens = ["", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]

n = int(input())

if 100 <= n <= 999:
    h = n // 100
    t = (n % 100) // 10
    u = n % 10
    
    if t == 1: 
        d = f"{hundreds[h]} {teens[u]}"
    else:
        d = f"{hundreds[h]} {tens[t]} {units[u]}".strip()
    
    print(d)
