w = {
    10: "десять", 11: "одиннадцать", 12: "двенадцать", 13: "тринадцать",
    14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать",
    18: "восемнадцать", 19: "девятнадцать", 20: "двадцать", 21: "двадцать одно",
    22: "двадцать два", 23: "двадцать три", 24: "двадцать четыре", 25: "двадцать пять",
    26: "двадцать шесть", 27: "двадцать семь", 28: "двадцать восемь", 29: "двадцать девять",
    30: "тридцать", 31: "тридцать одно", 32: "тридцать два", 33: "тридцать три",
    34: "тридцать четыре", 35: "тридцать пять", 36: "тридцать шесть", 37: "тридцать семь",
    38: "тридцать восемь", 39: "тридцать девять", 40: "сорок"
}

n = int(input())

if n in w:
    word = w[n]
    if n % 10 == 1 and n % 100 != 11:
        s = "учебное задание"
    elif 2 <= n % 10 <= 4 and not 12 <= n % 100 <= 14:
        s = "учебных задания"
    else:
        s = "учебных заданий"
    
    print(word, s)
